Autodesk.Revit.DB.Structure.ICodeCheckingParameterServerProxy.PerformCodeChecking(Autodesk.Revit.DB.Structure.CodeCheckingParameterServiceData)
The server's method that will be called when Revit User clicks the Code Checking parameter's button from the properties palette.
Remarks:
The server provides UI way for Revit user to view and modify the detail data corresponding with the parameter value.
The server may also modify the code checking parameter value itself during the execution.
The method should always return 'true' if the server is successfully executed, no matter whether the server changes anything.
Return 'false' or if the server throws, indicates a failed case, all changes made by the server will be discarded.
data:
The Code Checking data.
Returns:
Indicates whether the code checking parameter server is executed successfully.
Since:
2014